#!/bin/sh
# Все каталоги и подкаталоги, указнные в переменных, должны быть созданы заранее!
# Яндекс.Диск должен быть создан и примонтирован в системе. Точка монтирования - /mnt/yadisk
# Скрипт разделён на 4 блока, для наглядности.
# Для автоматизации резервного копирования можно добавить выполнение скрипта в cron, ежедневно.
echo "*********************************************************"
echo "********НАЧАЛО ЕЖЕДНЕВНОГО РЕЗЕРВНОГО КОПИРОВАНИЯ********"
echo "*********************************************************"
echo ""
echo "*********************************************************"
echo "*******ЭТАП 1. РЕЗЕРВНОЕ КОПИРОВАНИЕ ФАЙЛОВ САЙТОВ*******"
echo "*********************************************************"
#Задаём имя файла бэкапа, состоящее из даты и времени его создания
TIME=`date +%Y-%m-%d-%H:%M`
# Указываем каталог с файлами сайта (сайтов) для резервного копирования
WHAT=/home/www
# Указываем каталог на сервере, в котором будет создан бэкап
WHERE=/backup/DAY/www
# Указываем удалённый каталог (подкаталог) на Яндекс.Диске, куда будут копироваться создаваемые бэкапы
COPY=/mnt/yadisk/VDS/backup/DAY/www   
echo "НАЧИНАЕТСЯ СОЗДАНИЕ БЭКАПА"
tar -cpzf $WHERE/$TIME.tgz $WHAT
echo "СОЗДАНИЕ БЭКАПА УСПЕШНО ЗАВЕРШЕНО"
cp $WHERE/$TIME.tgz $COPY
echo "ФАЙЛ БЭКАПА УСПЕШНО СКОПИРОВАН НА ЯНДЕКС.ДИСК"
# Ищем и удаляем старые резервные копии с сервера, оставляем только последний.
# (или несколько, но не старше 30 минут с момента создания)
find $WHERE -mmin +30 -print -delete
# Ищем и удаляем с Яндекс.Диска файлы старше 6 дней, во избежание переполнения.
find $COPY -mtime +6 -print -delete
echo "СТАРЫЕ РЕЗЕРВНЫЕ КОПИИ УДАЛЕНЫ"
echo "*********************************************************"
echo "**********************КОНЕЦ ЭТАПА 1**********************"
echo "*********************************************************"
echo ""
echo "*********************************************************"
echo "*********ЭТАП 2. РЕЗЕРВНОЕ КОПИРОВАНИЕ ФАЙЛОВ БД*********"
echo "*********************************************************"
TIME=`date +%Y-%m-%d-%H:%M`
WHAT=/var/lib/mysql
WHERE=/backup/DAY/mysql_files
COPY=/mnt/yadisk/VDS/backup/DAY/mysql_files
echo "ОСТАНОВКА СЕРВИСА MYSQL"
service mysql stop
sleep 10s
echo "СЕРВИС MYSQL ОСТАНОВЛЕН"
echo "НАЧИНАЕТСЯ СОЗДАНИЕ БЭКАПА"
tar -cpzf $WHERE/$TIME.tgz $WHAT
echo "СОЗДАНИЕ БЭКАПА УСПЕШНО ЗАВЕРШЕНО"
service mysql start
echo "СЕРВИС MYSQL ЗАПУЩЕН"
cp $WHERE/$TIME.tgz $COPY
echo "ФАЙЛ БЭКАПА УСПЕШНО СКОПИРОВАН НА ЯНДЕКС.ДИСК"
find $WHERE -mmin +30 -print -delete
find $COPY -mtime +6 -print -delete
echo "СТАРЫЕ РЕЗЕРВНЫЕ КОПИИ УДАЛЕНЫ"
echo "*********************************************************"
echo "**********************КОНЕЦ ЭТАПА 2**********************"
echo "*********************************************************"
echo ""
echo "*********************************************************"
echo "*****ЭТАП 3.  РЕЗЕРВНОЕ КОПИРОВАНИЕ НАСТРОЕК СЕРВЕРА*****"
echo "*********************************************************"
TIME=`date +%Y-%m-%d-%H:%M`
WHAT=/etc
WHERE=/backup/DAY/etc
COPY=/mnt/yadisk/VDS/backup/DAY/etc
echo "НАЧИНАЕТСЯ СОЗДАНИЕ БЭКАПА"
tar -cpzf $WHERE/$TIME.tgz $WHAT
echo "СОЗДАНИЕ БЭКАПА УСПЕШНО ЗАВЕРШЕНО"
cp $WHERE/$TIME.tgz $COPY
echo "ФАЙЛ БЭКАПА УСПЕШНО СКОПИРОВАН НА ЯНДЕКС.ДИСК"
find $WHERE -mmin +30 -print -delete
find $COPY -mtime +6 -print -delete
echo "СТАРЫЕ РЕЗЕРВНЫЕ КОПИИ УДАЛЕНЫ"
echo "*********************************************************"
echo "**********************КОНЕЦ ЭТАПА 3**********************"
echo "*********************************************************"
echo""
echo "*********************************************************"
echo "*********ЭТАП 4.  РЕЗЕРВНОЕ КОПИРОВАНИЕ СКРИПТОВ*********"
echo "*********************************************************"
TIME=`date +%Y-%m-%d-%H:%M`
WHAT=/scripts
WHERE=/backup/DAY/scripts
COPY=/mnt/yadisk/VDS/backup/DAY/scripts
echo "НАЧИНАЕТСЯ СОЗДАНИЕ БЭКАПА"
tar -cpzf $WHERE/$TIME.tgz $WHAT
echo "СОЗДАНИЕ БЭКАПА УСПЕШНО ЗАВЕРШЕНО"
cp $WHERE/$TIME.tgz $COPY
echo "ФАЙЛ БЭКАПА УСПЕШНО СКОПИРОВАН НА ЯНДЕКС.ДИСК"
find $WHERE -mmin +30 -print -delete
find $COPY -mtime +6 -print -delete
echo "СТАРЫЕ РЕЗЕРВНЫЕ КОПИИ УДАЛЕНЫ"
echo "*********************************************************"
echo "**********************КОНЕЦ ЭТАПА 4**********************"
echo "*********************************************************"
echo ""
echo "*********************************************************"
echo "*******ЕЖЕДНЕВНОЕ РЕЗЕРВНОЕ КОПИРОВАНИЕ ЗАВЕРШЕНО********"
echo "*********************************************************"
